--liquibase formatted sql

--changeset vtsarenko:initial-schema-import-1
create table ingridient (
    id serial primary key,
    name varchar(100) not null,
    calories int not null,
    protein int not null,
    fats int not null,
    carbs int not null,
    cost numeric(2) not null,
    quantity varchar(100) not null
);
--rollback drop table ingridient;

--changeset vtsarenko:fake-data
insert into ingridient(name, calories, protein, fats, carbs, cost, quantity) values
('курица', 190, 16, 14, 0, 6.49, '1 кг'),
('яйцо куриное', 157, 13, 11, 1, 2.29, '10 шт'),
('хлеб ржаной', 192, 5, 1, 42, 0.86, '300 г'),
('молоко 3.2%', 59, 3, 3, 5, 2.95, '1 л'),
('молоко 1%', 41, 3, 1, 5, 2.79, '1 л'),
('мука пшеничная', 342, 9, 1, 75, 1.38, '500 г'),
('баклажан', 24, 1, 0, 5, 13.39, '1 кг'),
('нут', 364, 19, 6, 61, 2.65, '500 г'),
('авокадо', 212, 2, 20, 6, 15.99, '1 кг'),
('вода', 0, 0, 0, 0, 3.00, '5 л'),
('петрушка', 47, 4, 0, 8, 1.79, '70 г'),
('укроп', 38, 3, 1, 6, 1.79, '70 г'),
('соленые огурцы', 50, 1, 0, 2, 3.79, '1 кг'),
('соль', 0, 0, 0, 0, 0.48, '1 кг'),
('чеснок сушеный', 345, 0, 75, 0, 1.39, '20 г'),
('водоросль нори', 349, 46, 0, 41, 7.20, '200 г'),
('соевый соус', 58, 4, 0, 11, 4.19, '250 г'),
('оливковое масло', 824, 0, 92, 0, 16.99, '500 мл'),
('перец черный молотый', 251, 10, 3, 39, 2.49, '20 г'),
('кунжут черный', 565, 19, 48, 12, 1.39, '50 г'),
('сыр фета', 290, 17, 24, 0, 4.09, '250 г'),
('сметана', 160, 3, 15, 3, 1.88, '380 г'),
('капуста пекинская', 16, 1, 0, 2, 7.99, '1 кг'),
('перец', 59, 1, 0, 19, 13.99, '1 кг'),
('лук красный', 62, 1, 0, 16, 1.99, '1 кг'),
('огурцы маринованные', 20, 1, 0, 4, 7.09, '680 г'),
('сыр адыгейский', 230, 17, 18, 0, 13.43, '1 кг'),
('сыр твердый', 357, 22, 30, 0, 19.56, '1 кг'),
('чипсы нори', 476, 25, 24, 48, 15.16, '20 г');
--rollback delete from ingridient;


